---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchNmbOfPolesToCircuit
source: html/b77c9987-cf7a-6c29-f0e7-ecfa22fadbf0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchNmbOfPolesToCircuit Property

Cannot add [Element] to Circuit. The Number of Poles for [Element] does not match the Number of Poles ([Name]) for the Circuit.

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchNmbOfPolesToCircuit { get; }
```